In [1]:
import pandas as pd

In [2]:
df_movies = pd.read_csv(r'D:\Data Science\SampleDocuments\IMDb movies.csv',low_memory=False)
df_ratings = pd.read_csv(r'D:\Data Science\SampleDocuments\IMDb ratings.csv',low_memory=False)
df_movies = df_movies[['imdb_title_id','title','year','genre','country']]
df_ratings = df_ratings[['imdb_title_id','total_votes','mean_vote']]

# .merge()

Inner join

In [3]:
df1 = pd.DataFrame({'id': ['A', 'B', 'C', 'D'],
                    'age': [30, 23, 25, 22]})
df2 = pd.DataFrame({'id': ['C', 'D', 'E', 'F'],
                    'job': ['Doctor', 'Statistician',
                            'Accountant', 'Developer']})

In [4]:
df_inner_join = df1.merge(df2,on='id',how='inner')

In [5]:
# merge of df_movies and df_ratings
df_movies.merge(df_ratings,on='imdb_title_id',how='inner')

,imdb_title_id,title,year,genre,country,total_votes,mean_vote
0,tt0000009,Miss Jerry,1894,Romance,USA,154,5.9
1,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,589,6.3
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark",188,6.0
3,tt0002101,Cleopatra,1912,"Drama, History",USA,446,5.3
4,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,2237,6.9
...,...,...,...,...,...,...,...
85850,tt9908390,Le lion,2020,Comedy,"France, Belgium",398,5.5
85851,tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands,724,7.9
85852,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India,265,7.8
85853,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey,194,9.4
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain,102,6.8

Outer join

In [6]:
df1.merge(df2,on='id',how='outer')

  id   age           job
0  A  30.0           NaN
1  B  23.0           NaN
2  C  25.0        Doctor
3  D  22.0  Statistician
4  E   NaN    Accountant
5  F   NaN     Developer

In [7]:
# merge of df_movies and df_ratings
df_movies.merge(df_ratings,on='imdb_title_id',how='outer')

,imdb_title_id,title,year,genre,country,total_votes,mean_vote
0,tt0000009,Miss Jerry,1894,Romance,USA,154,5.9
1,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,589,6.3
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark",188,6.0
3,tt0002101,Cleopatra,1912,"Drama, History",USA,446,5.3
4,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,2237,6.9
...,...,...,...,...,...,...,...
85850,tt9908390,Le lion,2020,Comedy,"France, Belgium",398,5.5
85851,tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands,724,7.9
85852,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India,265,7.8
85853,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey,194,9.4
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain,102,6.8

Exclusive full join

In [8]:
df1.merge(df2,on='id',how='outer',indicator=True)

  id   age           job      _merge
0  A  30.0           NaN   left_only
1  B  23.0           NaN   left_only
2  C  25.0        Doctor        both
3  D  22.0  Statistician        both
4  E   NaN    Accountant  right_only
5  F   NaN     Developer  right_only

In [12]:
df1.merge(df2,on='id',how='outer',indicator=True).query("_merge == 'left_only' or _merge == 'right_only'")

  id   age         job      _merge
0  A  30.0         NaN   left_only
1  B  23.0         NaN   left_only
4  E   NaN  Accountant  right_only
5  F   NaN   Developer  right_only

In [13]:
# make a copy of the df_movies
df_copy = df_movies.copy(deep=False)

In [17]:
df_copy.iloc[:1000,0] = 'tt1234567890'

In [20]:
# merge of df copy and df rating exclusive left
df_copy.merge(df_ratings,on='imdb_title_id',how='left',indicator=True).query("_merge == 'left_only'")

,imdb_title_id,title,year,genre,country,total_votes,mean_vote,_merge
0,tt1234567890,Miss Jerry,1894,Romance,USA,NaN,NaN,left_only
1,tt1234567890,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia,NaN,NaN,left_only
2,tt1234567890,Den sorte drøm,1911,Drama,"Germany, Denmark",NaN,NaN,left_only
3,tt1234567890,Cleopatra,1912,"Drama, History",USA,NaN,NaN,left_only
4,tt1234567890,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy,NaN,NaN,left_only
...,...,...,...,...,...,...,...,...
995,tt1234567890,Agente segreto Z1,1930,Drama,USA,NaN,NaN,left_only
996,tt1234567890,Tom Sawyer,1930,"Adventure, Comedy, Drama",USA,NaN,NaN,left_only
997,tt1234567890,Tonka Sibenice,1930,Drama,"Czechoslovakia, Germany",NaN,NaN,left_only
998,tt1234567890,Top Speed,1930,"Comedy, Musical, Romance",USA,NaN,NaN,left_only
999,tt1234567890,True to the Navy,1930,"Action, Comedy, Romance",USA,NaN,NaN,left_only

In [21]:
# merge of df copy and df rating exclusive right
df_copy.merge(df_ratings,on='imdb_title_id',how='right',indicator=True).query("_merge == 'right_only'")

    imdb_title_id title year genre country  total_votes  mean_vote      _merge
0       tt0000009   NaN  NaN   NaN     NaN          154        5.9  right_only
1       tt0000574   NaN  NaN   NaN     NaN          589        6.3  right_only
2       tt0001892   NaN  NaN   NaN     NaN          188        6.0  right_only
3       tt0002101   NaN  NaN   NaN     NaN          446        5.3  right_only
4       tt0002130   NaN  NaN   NaN     NaN         2237        6.9  right_only
..            ...   ...  ...   ...     ...          ...        ...         ...
995     tt0021472   NaN  NaN   NaN     NaN          128        5.8  right_only
996     tt0021483   NaN  NaN   NaN     NaN          160        6.6  right_only
997     tt0021484   NaN  NaN   NaN     NaN          106        7.2  right_only
998     tt0021486   NaN  NaN   NaN     NaN          172        6.2  right_only
999     tt0021492   NaN  NaN   NaN     NaN          103        7.0  right_only

[1000 rows x 8 columns]